JavaJimbo/PIC32MX795_BrainBoard_Firmware/Robotnik Brain Board/Firmware/main.c
unsigned char ReadHBridgeData(unsigned char *ptrData);
void initHBridgeSPI(void);
unsigned char ADready = false;

void ClearCopyBuffer()
{
    int i;
    for (i = 0; i < MAXBUFFER; i++)
    {
        RS485RxBufferCopy[i] = '\0';
        // RS485RxBuffer[i] = '\0';
    }
}


unsigned char processPacketData(short packetDataLength, unsigned char *ptrPacketData, short *numServos, short *ptrServoPositions, unsigned char *command, unsigned char *subCommand)
{
    MConvertType servoValue;    
    short j, i = 0;  
    
    if (!CheckCRC(ptrPacketData, packetDataLength)) return false;    
    *command = ptrPacketData[i++];
    *subCommand = ptrPacketData[i++];
    *numServos = ptrPacketData[i++];
    
    
    if (*numServos > MAX_SERVOS) return false;
    j = 0;
    while(j < *numServos)
    {
        servoValue.b[0] = ptrPacketData[i++];
        servoValue.b[1] = ptrPacketData[i++];
        ptrServoPositions[j++] = servoValue.integer;
    }
    return true;
}

void PrintServoData(short numServos, short *ptrServoPositions, unsigned char command, unsigned char subCommand)
{
    int i;
    printf("\rOK! Com: %d, Sub: %d, servos %d: ", command, subCommand, numServos);
    for (i = 0; i < 10; i++) printf("%d, ", ptrServoPositions[i]);
}

unsigned char ReadHBridgeData(unsigned char *ptrData)
{
    unsigned char dataOut = 0;
    
    PWM_SPI_CS = 0;
    dataOut = SendReceiveSPI(0b00000000);
    ptrData[0] = dataOut;
    dataOut = SendReceiveSPI(0b00000000);
    ptrData[1] = dataOut;
    dataOut = SendReceiveSPI(0b00000000);
    ptrData[2] = dataOut;
    dataOut = SendReceiveSPI(0b00000000);
    ptrData[3] = dataOut;
    PWM_SPI_CS = 1;
    
    return 0;
}


int main(void)
{   
unsigned short i = 0, j = 0, numBytes;
FSFILE *filePtr;
char filename[] = "NextFile.txt";
char MessageOut[] = "\r\nThis is only going to add to the hilarity.";
unsigned char ch;    
short length = 0;
short counter = 0;
int PushButtonState = 0, PreviousPush = 0;
int loopCounter = 0;
unsigned char arrData[4];
unsigned char arrI2C1Test[128] = "You can do the do but not if I was U.";
unsigned char arrI2C3Test[128] = "Take #2: Testing I2C3 Yadda yadda yadda";
unsigned char dataByte = 0;
short servoPos;
unsigned char arrI2CTestIn[128];
short dataLength = 0;
short packetDataLength;
unsigned char PacketData[MAXBUFFER];
short numServos;
short ServoPositions[MAX_SERVOS];
unsigned char command, subCommand;
unsigned short EEaddress = 1234;
unsigned short SPIcounter = 0;

MConvertType convert;

    InitializeSystem();
    
    SD_CS = 1;
    PWM_SPI_CS = 1;   
    
    /*
    DelayMs(100);    
    printf("\rTesting SD_CS HIGH - wait for Media Detect...");
    while (!MDD_MediaDetect());     // Wait for SD detect to go low    
    printf("\rInitializing SD card...");
    while (!FSInit());        
    
    printf("\rOpening test file %s to write...", filename);
    filePtr = FSfopen(filename, FS_WRITE);        
    if (filePtr==NULL) printf("Error: could not open %s", filename);
    else
    {
        printf("\rSuccess! Opened %s. writing data\r", filename);    
        length = strlen(MessageOut);
        numBytes = FSfwrite(MessageOut, 1, length, filePtr);
        printf("\rLength of message: %d, bytes written: %d", length, numBytes);
        printf("\rClosing file");
        FSfclose(filePtr); 
    }   
    
    printf("\rOpening test file to read...");
    filePtr = FSfopen(filename, FS_READ);
    if (filePtr==NULL) printf("Error: could not open %s", filename);
    else
    {
        printf("\rSuccess! Opened %s. Reading data\r\r", filename);    
        do {                      
            numBytes = FSfread(&ch, 1, 1, filePtr);
            putchar(ch); 
        } while (!FSfeof(filePtr)); 
        printf("\rEND OF FILE");
        printf("\rClosing file");
        FSfclose(filePtr); 
    }   
    DelayMs(10);       

    
    
    DelayMs(400);
    
    printf("\r\rTESTING EEPROM");    
    initI2C(I2C1);           
    length = strlen(arrI2C1Test);
    DelayMs(100);
    printf("\rWriting I2C1 block: %d bytes @ %d", length, EEaddress);
    EepromWriteBlock(I2C1, EEPROM_ADDRESS, EEaddress, arrI2C1Test, length);
    printf ("Read byte: %d", (int) dataByte);
    DelayMs(100);    
    printf("\rReading I2C1 block");
    EepromReadBlock (I2C1, EEPROM_ADDRESS, EEaddress, arrI2CTestIn, length);    
    arrI2CTestIn[length] = '\0';
    printf("\rRead Data In: %s", arrI2CTestIn);   
    printf("\rDONE");
    */
    
    DelayMs(100);

    /*
    printf("\r\rTesting SPI", ActualRS485BaudRate);
    initHBridgeSPI();
    printf("\rBridge SPI initialized");
    PWM_DISABLE = 0;
    */
    printf("\rTesting CRC etc.");
    while(1)
    {
        if (RS485RxBufferFull)
        {
            RS485RxBufferFull = false;
            dataLength =  decodePacket(RS485RxBufferCopy, PacketData);            
            if (!processPacketData(dataLength, PacketData, &numServos, ServoPositions, &command, &subCommand)) 
                printf("\rCRC ERROR");
            else PrintServoData(numServos, ServoPositions, command, subCommand);                                    
            ClearCopyBuffer();
        }
    }
    
    printf("\r\rFeather Servo NO USB version");
    printf("\rInitializing Feather Servo Board at address 0x80: ");
    #define PCA9685_ADDRESS 0x80 // Basic default address for Adafruit Feather Servo Board 
    if (initializePCA9685(PCA9685_ADDRESS)) printf(" SUCCESS");
    else printf(" ERROR");       
    
    mAD1IntEnable(INT_ENABLED);
    
    DIR1 = 0;
    DIR2 = 0;
    DIR3 = 0;
    DIR4 = 0;
    PWM_DISABLE = 0;
    
   initHBridgeSPI();
   
    OC2RS = 0;
    OC3RS = 0;
    OC4RS = 0;
    OC5RS = 0;
    
    
    while(1)
    {
        if (ADready)
        {
            ADready = false;
            EnableAD = false;
            
            // printf("\r#%d: POT1 = %d, POT2 = %d, POT3 = %d POT4 = %d", counter++, ADresult[0], ADresult[1], ADresult[2], ADresult[3]);
            
            servoPos = (short)(ADresult[0]/4) + 22;      
            //T2CONbits.TON = 0; // Let her rip
            
            //ConfigIntTimer2(T2_INT_OFF | T2_INT_PRIOR_2);            
            if (!setPCA9685outputs(PCA9685_ADDRESS, 0, 0, servoPos)) printf(" ERROR");         
            printf("\r#%d: Servo 0 = %d", counter++, ADresult[0]);
                        
            mAD1IntEnable(INT_ENABLED);
            //ConfigIntTimer2(T2_INT_ON | T2_INT_PRIOR_2);
            //T2CONbits.TON = 1; // Let her rip

            //OC2RS = ADresult[0] * 2;
            //OC3RS = ADresult[1] * 2;
            //OC4RS = ADresult[2] * 2;
            //OC5RS = ADresult[3] * 2;            
            // printf("\r#%d: PWM1 = %d, PWM2 = %d, PWM3 = %d PWM4 = %d", counter++, OC2RS, OC3RS, OC4RS, OC5RS); 
            // printf("\r#%d: ENC1 = %d, ENC2 = %d, ENC3 = %d ENC4 = %d", counter++, EncoderOne, EncoderTwo, EncoderThree, EncoderFour);
            /*
            if (EncoderOneDir) printf("\r#%d: Enc Dir1: HIGH, ", counter++);
            else printf("\r#%d: Enc Dir1: LOW, ", counter++);
            
